In [3]:
import numpy as np
import pandas as pd

In [9]:
df = pd.DataFrame({'col1': [1,2,3,4],
              'col2': [444, 555, 666,444],
              'col3': ['abc', 'def', 'ghi' , 'xyz' ]}
            )

df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Finding unique value in col2

In [10]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [11]:
len(df['col2'].unique())

3

In [12]:
df['col2'].nunique()

3

In [13]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [16]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

Multiple condition

In [17]:
df[(df['col1'] > 2)  & (df['col2'] == 444) ]    # wrap these with parentheses

   col1  col2 col3
3     4   444  xyz

Apply method

In [20]:
def times2 (x):
    return x * 2

In [22]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [23]:
df['col2'].apply(lambda x : x *2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [24]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [25]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

## Pivot Table

In [27]:
data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
        'B': ['one', 'one', 'two', 'two', 'one', 'one' ],
        'C': ['x', 'y','x', 'y','x', 'y'],
        'D': [1,3,2,5,4,1]
       }

df = pd.DataFrame(data)

In [28]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [29]:
df.pivot_table(values = 'D', index=['A', 'B'], columns = 'C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [30]:
pwd

'C:\\Users\\USER\\Desktop\\UDEMY\\Python for Data Science and Machine Learning Bootcamp\\Pandas'

In [32]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [35]:
df.to_csv('My_output', index=False)  #If index =True the my index will become  a column

In [36]:
pd.read_csv('My_output')

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

## Reading html files

In [39]:
data = pd.read_html('https://www.fdic.gov/bank-failures/failed-bank-list')

In [40]:
type(data)

list

In [41]:
data[0]

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
5,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
6,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
7,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
8,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
9,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537